Examinator/src/Catalogs/СодержаниеСУЗ/СодержаниеСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СодержаниеСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СводыЗнанийСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЭлемент</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <comment>Item / parameters</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>limitConditions / attemptLimit</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПопытки</name>
    <comment>limitConditions / attemptAbsoluteDurationLimit (Тип: duration SCORM)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВыполнения</name>
    <comment>completionThreshold</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИнициализации</name>
    <comment>dataFromLMS</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПослеИстеченияВремени</name>
    <comment>timeLimitAction</comment>
    <type>
      <types>EnumRef.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьСсылкиНаТерминыГлоссария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьПользовательскиеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/СодержаниеСУЗ/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа ИЛИ ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ РазрешитьРедактироватьНаименование И ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлемент, "Наименование");
	КонецЕсли;
	
	Если ЭтоНовый()
		И ДополнительныеСвойства.Свойство("ПроверитьНаДубликат")
		И ДополнительныеСвойства.ПроверитьНаДубликат Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СодержаниеСУЗ.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
			|ГДЕ
			|	СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
			|	И СодержаниеСУЗ.Владелец = &Владелец
			|	И СодержаниеСУЗ.СсылкаНаЭлемент = &СсылкаНаЭлемент";
		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("СсылкаНаЭлемент", СсылкаНаЭлемент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			НаименованиеЭлемента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлемент, "Наименование");
			ТекстИсключения = НСТр("ru = 'Элемент ""%1"" не может быть добавлен, так как он уже содержится в курсе'");
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстИсключения, НаименованиеЭлемента);			
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
